# Applying a Function to Groups

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [2]:
df.groupby("Survived").apply(lambda x: x.count())

          Name  PClass  Age  Sex  Survived  SexCode
Survived
0          863     863  443  863       863      863
1          450     450  313  450       450      450